[
    {
        "company": "Vonage",
        "role": "Senior Frontend Engineer",
        "baseScore": 10,
        "startDate": "2023-01-01",
        "location": "Remote",
        "highlights": [
            { "content": "Collaborated in peer programming with junior developers, conducted technical interviews, and performed code reviews to ensure quality and maintain coding standards", "keywords": ["Peer Programming"], "baseScore": 0 }
        ],
        "projects": [
            { 
                "name": "Dashboard Components Library", 
                "description": "A Vue library with components using our internal design library to help developers across teams avoid reimplementing the same components for their dashboards.",
                "baseScore": 10,
                "highlights": [
                    { "content": "Created documentation to help developers contribute to or use the library, leveraging PRs to facilitate code reviews.", "keywords": ["Documentation", "Code Reviews"], "baseScore": 10 },
                    { "content": "Added unit tests and E2E tests using Vue Test Utils and Storybook, enabling developers to reuse components without needing to add additional tests.", "keywords": ["Unit Tests", "E2E Tests", "Vue Test Utils", "Storybook"], "baseScore": 0 },
                    { "content": "Implemented a CI/CD pipeline to deploy the library upon merging, with the ability to create snapshots for QA.", "keywords": ["CI/CD", "QA", "Snapshots"], "baseScore": 0 }
                ],
                "stack": ["Vue.js", "Storybook", "Vue Test Utils", "CI/CD"]
            },
            {
                "name": "Partner Portal", 
                "description": "Worked on a micro frontend infrastructure for a multi-tenant dashboard for company partners.", 
                "baseScore": 10,
                "highlights": [
                    { 
                        "keywords": ["Micro Frontends", "Architecture", "Communication"], 
                        "baseScore": 10, 
                        "content": "Designed an architecture for micro frontends across the teams to define how micro frontends should communicate with each other." 
                    },
                    { 
                        "keywords": ["Unit Tests", "Mockito", "Vue Test Utils"], 
                        "baseScore": 0, 
                        "content": "Added unit tests on the backend using Mockito and on the frontend using Vue Test Utils to ensure code quality and reliability." 
                    },
                    { 
                        "keywords": ["Microservices", "Backend Development"], 
                        "baseScore": 0, 
                        "content": "Developed the backend based on a microservices architecture to support the multi-tenant dashboard." 
                    }
                ],
                "stack": ["Vue.js", "Mockito", "Vue Test Utils", "Microservices"]
            },
            {
                "name": "No Code Platform", 
                "description": "Developed on an internal no-code platform which allows teams to create frontends to interact with different APIs across the company.", 
                "baseScore": 0,
                "highlights": [
                    { 
                        "keywords": ["No Code", "Platform Design"], 
                        "baseScore": 0, 
                        "content": "Designed and developed a second version of the platform to improve the experience of development." 
                    },
                    { 
                        "keywords": ["No Code", "Migration", "Security", "Cost Reduction"], 
                        "baseScore": 0, 
                        "content": "Migrated an entire internal tool to our no-code platform, saving cloud costs and increasing security by reducing vulnerabilities." 
                    },
                    { 
                        "keywords": ["No Code", "APIs", "Internal Tools"], 
                        "baseScore": 0, 
                        "content": "Migrated an entire project to an in-house no-code platform, eliminating 20+ security vulnerabilities, removing the need for a separate maintenance project, and reducing cloud costs by 30% (including web server, database, and backend)." 
                    }
                ],
                "stack": ["Vue.js", "No Code", "API"]
            }
        ]
    },
    {
        "company": "Freelance",
        "role": "Full Stack Developer",
        "startDate": "2023-01-01",
        "baseScore": 10,
        "location": "Remote",
        "highlights": [
            { "content": "Produced 3 award-winning projects featuring challenging designs and animations, demonstrating a quick adaptation to new projects and technologies (Awards: 2 Mention of Honor at Awwwards and recognition as 'Site of the Day' at Mindsparkle and CSSWinner", "keywords": ["Design"], "baseScore": 0 },
            { "content": "Integrated Sentry into all the solutions for the clients, resulting in a significant decrease in errors and boosting customer satisfaction. This allowed for immediate detection and resolution of the server in less than 24 hours", "keywords": ["Monitoring"], "baseScore": 0 },
            { "content": "Speeded up project set-up time by creating a template repository with git, streamlining the process for new projects. Standardizing build process using webpack", "keywords": [], "baseScore": 0 },
            { "content": "Strengthened communication among our team of 10 developers and designers and project delivery by integrating the use of agile methodologies and SCRUM-aligned project planning in Asana", "keywords": ["SCRUM"], "baseScore": 0 },
            { "content": "Implemented a CI/CD process using GitHub Actions to enable automatic updates to the staging area for each commit, resulting in improved development and QA efficiency", "keywords": ["CI/CD"], "baseScore": 0 }
        ],
        "projects": [
            { 
                "name": "Voice Chatbot", 
                "description": "Created a company assistant which uses LLM to get context to the company and interacts with end users through voice, designed to recommend and also perform actions like scheduling a call or registering.",
                "baseScore": 0,
                "highlights": [
                    { 
                        "content": "Created an extensible infrastructure which allows to easily extend the capabilities of the chatbot for new clients.", 
                        "keywords": ["Extensible Infrastructure", "Chatbot"], 
                        "baseScore": 0 
                    },
                    { 
                        "content": "Created a design system for the chatbot which allows performing different animations and transitions during the conversation flow.", 
                        "keywords": ["Design System", "Animations", "Transitions"], 
                        "baseScore": 0 
                    }
                ],
                "stack": ["React", "Vite", "LLM", "Voice Recognition", "Design System"]
            },
            {
                "name": "Zanbeek", 
                "description": "", 
                "baseScore": 0,
                "highlights": [
                    {"content": "", "keywords": [""], "baseScore": 0}
                ],
                "stack": ["Vanilla JS", "Webpack", "Gulp", "Docker", "SASS", "GSAP", "Figma"] 
            },
            {
                "name": "Layers", 
                "description": "",
                "baseScore": 0,
                "highlights": [
                    { "keywords": [], "baseScore": 0, "content": ""}
                ], 
                "stack": ["Vanilla JS", "Webpack", "Gulp", "Docker", "SASS", "GSAP", "Figma"]
            }
        ]
    }
]